OpenDarwin-CVS/SEDarwin/sedarwin7/src/darwin/mac_cmds/mexec/mexec.8
.\" Copyright (c) 2006 SPARTA, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd March 8, 2006
.Dt MEXEC 8
.Os
.Sh NAME
.Nm mexec 
.Nd "execute command with a new MAC label"
.Sh SYNOPSIS
.Nm
.Ar label
.Ar command
.Op Ar arg ...
.Sh DESCRIPTION
The
.Nm
utility attempts to execute
.Ar command
with the process label
.Ar label .
If sucessful,
.Ar command
replaces the currently-running process (no
.Xr fork 2
is performed).
.Sh SEE ALSO
.Xr exec 1 ,
.Xr fork 2 ,
.Xr mac_execve 3 ,
.Xr mac 4 ,
.Xr maclabel 7 ,
.Xr getpmac 8 ,
.Xr setfmac 8
