OpenDarwin-CVS/SEDarwin/sedarwin7/src/darwin/mac_cmds/lcs/lcs.8
.\" Copyright (c) 2005 SPARTA, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/examples/mdoc/example.1,v 1.23 2005/01/16 22:22:28 ru Exp $
.\"
.\" Note: The date here should be updated whenever a non-trivial
.\" change is made to the manual page.
.Dd September 23, 2005
.Dt LCS 8
.Os
.Sh NAME
.Nm lcs 
.Nd "show login context information"
.Sh SYNOPSIS
.Nm
.Op Fl l Ar lcid | Fl L
.Op Fl phZ
.Sh DESCRIPTION
The
.Nm
command displays a list of Login Contexts currently active
on a system.
Its operation is modified by the following options:
.Pp
.Bl -tag -width ".Fl l Ar lcid"
.It Fl l Ar lcid
Displays information only for the Login Context identifed by
.Ar lcid
.It Fl L
Displays information only for the Login Context the current process
is a member of, if any.
.It Fl p
Displays an expanded list of processes.
.It Fl h
Display help/usage information.
.It Fl Z
Show Login Context MAC labels.
.El
.Sh SEE ALSO
.Xr getlcmac 8 ,
.Xr setlcmac 8 ,
.Xr mac 4 ,
.Xr maclabel 7
.Sh AUTHORS
This
manual page was written by
.An Matthew N. Dodd Aq Matthew.Dodd@sparta.com .
