OpenDarwin-CVS/SEDarwin/sedarwin7/src/darwin/mac_cmds/setfsmac/setfsmac.8
.\" Copyright (c) 2002 Networks Associates Technology, Inc.
.\" All rights reserved.
.\" 
.\" This software was developed for the FreeBSD Project by Chris
.\" Costello at Safeport Network Services and Network Associates
.\" Laboratories, the Security Research Division of Network Associates,
.\" Inc. under DARPA/SPAWAR contract N66001-01-C-8035 ("CBOSS"), as
.\" part of the DARPA CHATS research program.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" $FreeBSD$
.Dd November 18, 2002
.Dt SETFSMAC 8
.Sh NAME
.Nm setfsmac
.Nd set specific varied MAC labels for trees of file system objects
.Sh SYNOPSIS
.Nm
.Op Fl evx
.Op Fl f Ar specfile
.Op Fl s Ar specfile
.Ar path
.Op Ar ...
.Sh DESCRIPTION
The
.Nm
utility takes any number of specification files as input and sets the MAC labels on arbitrary file system hierarchies.
Path names specified will be visited in order as given on the command line, and each tree will be traversed in pre-order.
(Generally, it will not be very useful to use relative, instead of absolute, paths.)
The labels that a given file matches will be combined and set in a single transaction.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl e
Treat any filesystems encountered which do not support MAC labelling as errors, instead of warning and skipping past them.
.It Fl f Ar specfile
Add the specifications in
.Ar specfile
as a set of which at most one will be applied to each file traversed per
.Fl f Ar specfile
given.
.It Fl h
Apply
.Ar label
to symbolic links encountered, rather than their targets.
.It Fl s Ar specfile
Add the SEBSD-style specifications in
.Ar specfile
as a set of which at most one will be applied to each file traversed per
.Fl f Ar specfile
given.
The prefix
.Dq sebsd/
will automatically be prepended to the labels in this file, and labels matching
.Dq <<none>>
will be explicitly not relabeled.
.It Fl v
Increase the amount of verbosity.
When given, information detailing the labelling operation is printed while in progress.
.It Fl x
Do not cross recurse into new filesystems when traversing them.
.El
.Sh SEE ALSO
.Xr mac 3 ,
.Xr mac_set_file 3 ,
.Xr mac_set_link 3 ,
.Xr re_format 7 ,
.Xr getfmac 8 ,
.Xr setfmac 8 ,
.Xr mac 9
